import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-about',
  templateUrl: './about.component.html',
  styleUrls: ['./about.component.css']
})
export class AboutComponent implements OnInit {

  constructor() { }

  ngOnInit(): void {
  }

  aboutParagraphs:string[] = [
    `Η συνέλευση του game over δημιουργήθηκε  το Σεπτέμβρη του 2010 σε μια ανοικτή αλλά συλλογικά συγκροτημένη διαδικασία έρευνας και δράσης για τις πραγματικές αιτίες της κρίσης και της παρακμής του υπάρχοντος μοντέλου εκπαίδευσης· και, ταυτόχρονα, επανασύνδεσης της κριτικής με την (και ενάντια στην) συγκυρία (γνωσιολογική, ιδεολογική, πειθαρχική) της “χρήσιμης καπιταλιστικά γνώσης”. Σ’ αυτή τη συνέλευση συμμετέχουν άντρες και γυναίκες που σπουδάζουν σε διάφορα απ’ τα τρέχοντα γνωστικά πεδία του εκπαιδευτικού συστήματος (φοιτητές / φοιτήτριες), αλλά και “εξωπανεπιστημιακά στοιχεία”. Η αφετηριακή παραδοχή της συνέλευσης του game over είναι ότι η γνωσιολογική, ιδεολογική και πειθαρχική αναδιάρθρωση των “γνώσεων” δεν είναι κάτι που αφορά αποκλειστικά φοιτητές ή δασκάλους, “εσωτερικούς” δηλαδή του εκπαιδευτικού συστήματος, αλλά την εργατική τάξη, σαν τέτοια, στο σύνολό της. Και μέσα στον όρο “εργατική τάξη” εννοούμε κι όλους εκείνους τους πτυχιούχους που αντιλαμβάνονται (χωρίς να θέλουν να το πιστέψουν) ότι κρατάνε ένα εκπαιδευτικό μέρισμα (ένα ή και περισσότερα πτυχία) που καθόλου δεν τους απαλλάσσει απ’ το να είναι μέρος της σύγχρονης εργατικής τάξης, απ’ την άποψη της θέσης τους στην αγορά εργασίας.`,
    `Αυτό που έχει κάνει ως τώρα η συνέλευση του game over, και θα συνεχίσει να το κάνει, σαν ένα απ’ τα κυριότερα έργα της (αν και όχι το μοναδικό) είναι να ερευνήσει τις βασικότερες παραμέτρους της γνωσιολογικής Αλλαγής Παραδείγματος έτσι όπως αυτή εξελίσσεται διαρκώς, και έτσι όπως τη ζουν οι πάντες χωρίς να την αναγνωρίζουν. Η εκτίμηση της συνέλευσης του game over είναι ότι η ουσιαστική, εύστοχη, και πολιτικά αναγκαία κριτική και δράση, δεν μπορεί να είναι η υπεράσπιση του “παλιού” συστήματος, αλλά η κριτική δυνατότητα αναγνώρισης, ανάλυσης και αξιολόγησης όσων συμβαίνουν τώρα, και - κατ’ αρχήν - η δράση κοινοποίησης / δημοσιοποίησης των συμπερασμάτων. Αφού μάλιστα “αυτά - που - συμβαίνουν - τώρα” περικλείουν και τις τάσεις για τις μελλοντικές εξελίξεις. Μ’ άλλα λόγια η συνέλευση του game over απορρίπτει την όλο και πιο μίζερη ρουτίνα ξεπερασμένων και ξεπεσμένων “φοιτητικών κινημάτων”, και εργάζεται για ένα κίνημα θεωρητικής και πρακτικής ριζοσπαστικής κριτικής που θα είναι συνεπές με την εποχή του. Ούτε έχει, ούτε θέλει να έχει η συνέλευση του game over, σα συλλογικό εγχείρημα, οποιαδήποτε σχέση με φοιτητικές παρατάξεις, φοιτητικό συνδικαλισμό, ακαδημαϊκούς κύκλους, κλπ κλπ.`,
    `Κατά τη γνώμη αλλά και την εμπειρία μας, αυτή η απαραίτητη κριτική μπορεί να γίνει αποτελεσματικά, σε βάθος, και με συνοχή, πέρα και ενάντια στις “εξειδικεύσεις” και στις “ειδικότητες” που παράγει το παλιό σύστημα. Απ’ αυτή την άποψη η συνέλευση του game over είναι και μια διαδικασία συλλογικής αυτομόρφωσης, που φυσικά δε σκοπεύει σε καμία καθεστωτική επικύρωση και εξαργύρωση.`,
    `Τέλος, η συνέλευση του game over αντιμετωπίζει τις υποδομές του παραδοσιακού εκπαιδευτικού συστήματος σαν έναν παλιάς προέλευσης συλλογικό / κοινωνικό πλούτο, που με κανέναν τρόπο δεν πρέπει να αφεθεί στη λεηλασία ή στην εκμετάλλευση των επιτήδειων φίλων της ιδιωτικοποίησης, αλλά αντίθετα πρέπει και μπορεί να αξιοποιείται, στο όνομα της ποιοτικής και δυναμικής κριτικής έρευνας του παρόντος και του μέλλοντος.`


  ]

}
